src/Catalogs/Кластеры1С/Кластеры1С.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Кластеры1С</name>
  <attributes>
    <name>АдресСервераАдминистрирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортСервераАдминистрирования</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательЦентральногоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольЦентральногоСервера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПортКластера</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольАдминистратораКластера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторКластера</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>Защищен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Активен</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СчетчикПотребленияРесурсов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВерсияПлатформы</name>
    <type>
      <types>CatalogRef.ВерсииПлатформы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РабочиеСерверыКластера</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Порт</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>4</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторРабочегоСервера</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/InformationRegisters/ТекущиеЗаданияОбъектов/ТекущиеЗаданияОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТекущиеЗаданияОбъектов</name>
  <resources>
    <name>ИдентификаторЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <dimensions>
    <name>ИсточникЗадания</name>
    <type>
      <types>CatalogRef.Кластеры1С</types>
      <types>CatalogRef.ИнформационныеБазы</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Catalogs/ИнформационныеБазы/ИнформационныеБазы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИнформационныеБазы</name>
  <owners>Catalog.Кластеры1С</owners>
  <attributes>
    <name>ИмяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверБД</name>
    <type>
      <types>CatalogRef.СерверыБД</types>
    </type>
  </attributes>
  <attributes>
    <name>БазаДанных</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Назначение</name>
    <type>
      <types>EnumRef.НазначенияИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.ПользователиИБ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторБазы</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмяПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПарольПользователяИБ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеВКластере</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Конфигурация</name>
    <type>
      <types>CatalogRef.Конфигурации</types>
    </type>
  </attributes>
  <attributes>
    <name>ХранилищеКонфигурации</name>
    <type>
      <types>CatalogRef.ХранилищаКонфигураций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВебСервер</name>
    <type>
      <types>CatalogRef.ВебСерверы</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыИнформационнойБазы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИспользуетсяПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйРазмер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Доступ</name>
    <attributes>
      <name>ПользовательГруппа</name>
      <type>
        <types>CatalogRef.ПользователиИБ</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Расширения</name>
    <attributes>
      <name>ИмяРасширения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ХранилищеРасширения</name>
      <type>
        <types>CatalogRef.ХранилищаКонфигураций</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>WebСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>HTTPСервисы</name>
    <attributes>
      <name>ИмяСервиса</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ВебСерверы</name>
    <attributes>
      <name>ВебСервер</name>
      <type>
        <types>CatalogRef.ВебСерверы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

src/Catalogs/ПравилаПроверкиОбъектов/ПравилаПроверкиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПравилаПроверкиОбъектов</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ИнформационныеБазы</name>
      <description>Информационные базы</description>
    </items>
    <items>
      <name>Кластеры1С</name>
      <description>Кластеры 1С</description>
    </items>
    <items>
      <name>СУБД</name>
      <description>СУБД</description>
    </items>
  </predefined>
  <attributes>
    <name>ТипРезультатаПроверки</name>
    <type>
      <types>EnumRef.ТипРезультатаПроверкиОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/Кластеры1С/ManagerModule.bsl
Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	Если ВидФормы = "ФормаОбъекта" И Не ЗначениеЗаполнено(Параметры) Тогда 
		СтандартнаяОбработка = Ложь;
		ВыбраннаяФорма = "ФормаНовогоЭлемента";
	КонецЕсли;
	
КонецПроцедуры
   
Функция ПолучитьСостояниеКластера(Кластер) Экспорт
		
	Возврат Неопределено;
	
КонецФункции

Функция ПолучитьПараметрыАдминистрированияКластера(Кластер) Экспорт
	
	ПараметрыАдминистрированияКластера = АдминистрированиеКластера.ПараметрыАдминистрированияКластера();
	ЗаполнитьЗначенияСвойств(ПараметрыАдминистрированияКластера, Кластер);
	
	Возврат ПараметрыАдминистрированияКластера;
		
КонецФункции

Функция ПолучитьМакетОписанияКластера(Кластер) Экспорт
	
	МакетСводнойИнформации = Справочники.Кластеры1С.ПолучитьМакет("МакетСводнойИнформации");
	
	ОбластьЗаголовок				= МакетСводнойИнформации.ПолучитьОбласть("Заголовок");
	ОбластьСтрокаСоставаКластера	= МакетСводнойИнформации.ПолучитьОбласть("СтрокаСоставаКластера");
	ОбластьПодробнее				= МакетСводнойИнформации.ПолучитьОбласть("ОбластьПодробнее");	
	ОбластьБазыЗаголовок			= МакетСводнойИнформации.ПолучитьОбласть("БазыЗаголовок");
	ОбластьБазыСтрока				= МакетСводнойИнформации.ПолучитьОбласть("БазыСтрока");
	
	ТабличныйДокументОписание = Новый ТабличныйДокумент();
	ТабличныйДокументОписание.Вывести(ОбластьЗаголовок);
	
	ПараметрыАдминистрированияКластера = ПолучитьПараметрыАдминистрированияКластера(Кластер);
	
	ОписаниеКластераМассив = АдминистрированиеКластера.СвойстваКластеров(ПараметрыАдминистрированияКластера);
	
	Для Каждого ЭлементМассиваКластеров Из ОписаниеКластераМассив Цикл
		
		ОбластьСтрокаСоставаКластера.Параметры.ИмяКластера		= ЭлементМассиваКластеров["name"];  	
		ОбластьСтрокаСоставаКластера.Параметры.ИмяКомпьютера	= ЭлементМассиваКластеров["host"];
		ОбластьСтрокаСоставаКластера.Параметры.ПортКластера 	= ЭлементМассиваКластеров["port"]; 
		ОбластьСтрокаСоставаКластера.Параметры.Идинтификатор	= ЭлементМассиваКластеров["cluster"]; 
		ТабличныйДокументОписание.Вывести(ОбластьСтрокаСоставаКластера);
		
		ОбластьПодробнее.Параметры.ОписаниеКластера = Новый Структура("ПараметрыКластера", ЭлементМассиваКластеров);
		ТабличныйДокументОписание.Вывести(ОбластьПодробнее);
		
	КонецЦикла;
	
	МассивБазКластера = АдминистрированиеКластера.СвойстваИнформационныхБаз(Кластер.ИдентификаторКластера, 
																				 ПараметрыАдминистрированияКластера);

	ТабличныйДокументОписание.Вывести(ОбластьБазыЗаголовок);

	Для Каждого БазаКластера Из МассивБазКластера Цикл
		
		ЗарегестрированнаяБаза = Справочники.ИнформационныеБазы.НайтиПоРеквизиту("ИдентификаторБазы", 
																						БазаКластера["infobase"]);
		
		Если Не ЗначениеЗаполнено(ЗарегестрированнаяБаза) Тогда
			ОбластьБазыСтрока.Параметры.НаименованиеБазы = БазаКластера["name"];
			ОбластьБазыСтрока.Параметры.ПараметрыБазы = Новый Структура("ПараметрыБазы", БазаКластера);	
			ТабличныйДокументОписание.Вывести(ОбластьБазыСтрока);
		КонецЕсли;
					
	КонецЦикла;
	
	Возврат ТабличныйДокументОписание;
	
КонецФункции

Функция НачатьРегистрациюБазКластера(Кластер) Экспорт

	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияПроцедуры();
	ПараметрыВыполнения.КлючФоновогоЗадания		= Кластер.УникальныйИдентификатор();
	ПараметрыВыполнения.ОжидатьЗавершение			= 0;
	ПараметрыВыполнения.ЗапуститьВФоне				= Истина;
	
	Результат = ДлительныеОперации.ВыполнитьПроцедуру(ПараметрыВыполнения, 
												"Справочники.Кластеры1С.СоздатьБазыПоДаннымКластера",
												Кластер);
	
	Возврат Результат;

КонецФункции // НачатьРегистрациюБазКластера()

Процедура СоздатьБазыПоДаннымКластера(Кластер) Экспорт
	
	БлокировкаКластера = Новый БлокировкаДанных;

	ЭлементБлокировки = БлокировкаКластера.Добавить("Справочник.Кластеры1С");
	ЭлементБлокировки.УстановитьЗначение("Ссылка", Кластер);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	
	ЭлементБлокировки = БлокировкаКластера.Добавить("РегистрСведений.ТекущиеЗаданияОбъектов");
	ЭлементБлокировки.УстановитьЗначение("ИсточникЗадания", Кластер);
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Разделяемый;
	
	НачатьТранзакцию();
	Попытка
		
		БлокировкаКластера.Заблокировать();
		
		ЗаписьТекущегоЗадания = РегистрыСведений.ТекущиеЗаданияОбъектов.СоздатьМенеджерЗаписи(); 
		ЗаписьТекущегоЗадания.ИсточникЗадания = Кластер; 
		ЗаписьТекущегоЗадания.Записать();
	
		СтрукутараПараметров = Константы.ОбщиеПараметрыАутентификации.ПолучитьСтруктуруНастроекПоУмолчанию();
		ПараметрыАвторизации = Новый Структура("ПользовательИБ, ПарольИБ");
		ЗаполнитьЗначенияСвойств(ПараметрыАвторизации, СтрукутараПараметров);
		
		ПараметрыКластера = АдминистрированиеЭлементовКластера.ПолучитьПараметрыКластера(Кластер);
		
		МассивИдентификаторовАктуальныхБаз = Новый Массив;
		
		Для Каждого АдминистрированиеБазыДанных Из ПараметрыКластера.ИнформационныеБазы Цикл
			ЗарегестрироватьИнформационнуюБазу(Кластер, АдминистрированиеБазыДанных, ПараметрыАвторизации);
			МассивИдентификаторовАктуальныхБаз.Добавить(АдминистрированиеБазыДанных.ИдентификаторИнформационнойБазы);
		КонецЦикла;
	
		ПроверкаСостоянияОбъектов.ПроверитьАктуальностьЗарегистрированныхБаз(Кластер, МассивИдентификаторовАктуальныхБаз);
	
		ЗафиксироватьТранзакцию();	
	Исключение
		ОтменитьТранзакцию();
		ОбщегоНазначения.СообщитьПользователю(ОписаниеОшибки());
	КонецПопытки;
	
	МенеджерЗаписи = РегистрыСведений.ТекущиеЗаданияОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.ИсточникЗадания = Кластер;
	МенеджерЗаписи.Прочитать();
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры

Процедура ЗарегестрироватьИнформационнуюБазу(Кластер,
										АдминистрированиеБазыДанных,
										ПараметрыАвторизации = Неопределено,
										ПерезаполнитьДанные = Ложь) Экспорт;
										
										
	Если ПараметрыАвторизации = Неопределено Тогда
		ПараметрыАвторизации = Новый Структура("ПользовательИБ, ПарольИБ");
	КонецЕсли;
	
	ИнформационнаяБазаСсылка = Справочники.ИнформационныеБазы.НайтиПоРеквизиту("ИдентификаторБазы", 
														АдминистрированиеБазыДанных.ИдентификаторИнформационнойБазы);
	Если ЗначениеЗаполнено(ИнформационнаяБазаСсылка) Тогда 
		Если ПерезаполнитьДанные Тогда
			ИнформационнаяБаза = ИнформационнаяБазаСсылка.ПолучитьОбъект();
		Иначе
			Возврат;
		КонецЕсли;
	Иначе
		ИнформационнаяБаза = Справочники.ИнформационныеБазы.СоздатьЭлемент();
		ИнформационнаяБаза.ИдентификаторБазы = АдминистрированиеБазыДанных.ИдентификаторИнформационнойБазы;
	КонецЕсли;
	
	Попытка
		АдминистрированиеБазыДанных.ВыполнитьАутентификацию(ИнформационнаяБаза.ИмяПользователяИБ, 
														ИнформационнаяБаза.ПарольПользователяИБ);
	Исключение
		Попытка
			АдминистрированиеБазыДанных.ВыполнитьАутентификацию(ПараметрыАвторизации.ПользовательИБ, 
															ПараметрыАвторизации.ПарольИБ);
		Исключение
			Правило = Справочники.ПравилаПроверкиОбъектов.АвторизацияИнформационнойБазы;
			ПроверкаСостоянияОбъектов.ЗаписатьРезультатПроверки(ИнформационнаяБазаСсылка, Правило);
		КонецПопытки;
	КонецПопытки;
	
	ИнформационнаяБаза.Владелец		= Кластер;
	ИнформационнаяБаза.Наименование	= АдминистрированиеБазыДанных.Имя;
	ИнформационнаяБаза.ИмяИБ			= АдминистрированиеБазыДанных.Имя;
	ИнформационнаяБаза.СерверБД		= Справочники.СерверыБД.ПолучитьСерверПоИмени(АдминистрированиеБазыДанных, Истина);
	ИнформационнаяБаза.БазаДанных		= АдминистрированиеБазыДанных.ИмяБазыДанных;
	ИнформационнаяБаза.ОписаниеВКластере	= АдминистрированиеБазыДанных.Описание;
	
	ИнформационнаяБаза.Записать();
	
КонецПроцедуры
